jbobrow/AutomaTiles/Arduino/AutomaTiles/avr/boards.txt
# AutomaTile Board Configuration
#
# For more information see:
# - https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
# - https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6
#

##############################################################
# AutomaTile Programming Configuration
automatile.name=AutomaTile Legacy
automatile.bootloader.low_fuses=0x62
automatile.bootloader.high_fuses=0xdf
automatile.bootloader.extended_fuses=0xff
automatile.bootloader.unlock_bits=0xFF
automatile.bootloader.lock_bits=0xFF
automatile.bootloader.tool=arduino:avrdude
automatile.build.mcu=attiny84
automatile.build.f_cpu=1000000L
automatile.build.core=AutomaTiles
automatile.build.board=AUTOMATILE
automatile.upload.tool=arduino:avrdude
automatile.upload.maximum_size=8192
automatile.upload.speed=115200

